{
  "videos": [
    {
      "id": "1",
      "title": "¿Qué Significa Pensar Como Programador?",
      "category": "Recomendado",
      "image": "https://img.youtube.com/vi/ov7vA5HFe6w/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=ov7vA5HFe6w",
      "description": "¿Cuáles son las principales características de un programador? ¿Qué habilidades y competencias debe tener alguien que quiere seguir esa carrera?"
    },
    {
      "id": "2",
      "title": "¿Cuándo usar let, var y const?",
      "category": "Front End",
      "image": "https://img.youtube.com/vi/PztCEdIJITY/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=PztCEdIJITY",
      "description": "¿A veces cuando estás programando sientes dificuldades en saber en qué momento utilizar let, var o const para declarar una variable? En este video te sacamos estas dudas, además de explicarte lo que es escopo global y local en JavaScript."
    },
    {
      "id": "3",
      "title": "¿Qué es JavaScript?",
      "category": "Front End",
      "image": "https://img.youtube.com/vi/GJfOSoaXk4s/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=GJfOSoaXk4s",
      "description": "JavaScript: ¿qué es y cómo se hizo este lenguaje que genera muchas discusiones y debates entre la gente del área de desarrollo? "
    },
    {
      "id": "4",
      "title": "Box Model y Box sizing",
      "category": "Front End",
      "image": "https://img.youtube.com/vi/ts9qfCKamKg/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=ts9qfCKamKg",
      "description": "En este Alura+ nuestra instructora front-end, Jeanmarie Quijada, nos ayudará a entender que es Box Model, uno de los conceptos fundamentales para la construcción correcta de layouts de páginas web."
    },
    {
      "id": "5",
      "title": "Spring Framework. ¿Qué es?",
      "category": "Back End",
      "image": "https://img.youtube.com/vi/t-iqt1b2qqk/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=t-iqt1b2qqk",
      "description": "¿Busca un framework  para utilizar en sus proyectos? ¿Conoce Spring Framework? Spring es el framework más usado de Java. Nos ofrece herramientas que nos permiten crear proyectos más avanzados, con mejores prácticas y en menor tiempo. También posee una gran comunidad, lo que nos brinda muchísima documentación y ayuda."
    },
    {
      "id": "6",
      "title": "¿Qué es SQL y NoSQL?",
      "category": "Back End",
      "image": "https://img.youtube.com/vi/cLLKVd5CNLc/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=cLLKVd5CNLc",
      "description": "¿Cuáles son las diferencias entre una estructura de datos relacional (SQL) y una no relacional (NoSQL) y cuáles son las principales ventajas de cada una? Álvaro Camacho lo explica en este vídeo."
    },
    {
      "id": "7",
      "title": "Simplificando tu código en Java: Conoce los enum",
      "category": "Back End",
      "image": "https://img.youtube.com/vi/EoPvlE85XAQ/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=EoPvlE85XAQ",
      "description": "¿Escribir muchas variables del tipo constantes en Java te parece un proceso tedioso y que genera muchas líneas de código? En este Alura+ la instructora Génesys Rondón nos enseña a simplificar esta tarea usando un tipo de dato especial llamado enum."
    },
    {
      "id": "8",
      "title": "Descubre todo sobre el ChatGPT: Decifrando los Secretos de los Grandes Modelos de Lenguaje",
      "category": "Inteligencia Artificial",
      "image": "https://img.youtube.com/vi/PwheldW6V98/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=PwheldW6V98",
      "description": "En este episodio, exploraremos cómo funcionan los Grandes Modelos de Lenguaje (LLMs) y qué son los Tokens. Descubre cómo adquieren contexto y se entrenan los LLM. Además, cubriremos los parámetros de ChatGPT y proporcionaremos ejemplos prácticos para una comprensión más profunda de los LLM."
    },
    {
      "id": "9",
      "title": "Como mantenerse despierto con IA",
      "category": "Inteligencia Artificial",
      "image": "https://img.youtube.com/vi/yHpAUOmAAd0/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=yHpAUOmAAd0",
      "description": "¿Qué tal crear un despertador utilizando Interligencia Artificial? En este Alura+ nuestro instructor Alejandro Gamarra te enseñará como. ¡Ven a conocerlo!"
    },
    {
      "id": "10",
      "title": "Conociendo la API de Open AI",
      "category": "Inteligencia Artificial",
      "image": "https://img.youtube.com/vi/tDG29s1IVx8/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=tDG29s1IVx8",
      "description": "¿Te interesa aprender a conectar tus aplicaciones Java con la API de OpenAI? En este video te llevaremos paso a paso desde la creación de tu cuenta hasta la exploración de los principales recursos de la API, incluyendo modelos, costos y el uso del playground."
    },
    {
      "id": "11",
      "title": "7 Consejos de Diseño para Programadores Front-End",
      "category": "Front End",
      "image": "https://img.youtube.com/vi/n189TdfbQIA/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=n189TdfbQIA",
      "description": "Descubre 7 consejos prácticos para mejorar tus diseños web como programador Front-End. Basado en un artículo de Adam Wathan, creador de Tailwind CSS, te mostraré trucos sencillos que marcarán la diferencia en tus proyectos."
    },
    {
      "id": "12",
      "title": "¿Qué es React y por qué domina el desarrollo frontend?",
      "category": "Front End",
      "image": "https://img.youtube.com/vi/kEMr0rFjB7E/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=kEMr0rFjB7E",
      "description": "En este video te enseñaremos, con la calidad que siempre representa a EDteam, cómo funciona React, qué lo diferencia de otras tecnologías y, sobre todo, por qué es el rey del frontend."
    },
    {
      "id": "13",
      "title": "Los roles en frontend - La mejor explicación en español",
      "category": "Front End",
      "image": "https://img.youtube.com/vi/N8mFHB7JDkw/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=N8mFHB7JDkw",
      "description": "Cómo nos muestra Álvaro en el vídeo, hay grandes oportunidades laborales para los desarrolladores de Frontend."
    },
    {
      "id": "14",
      "title": "Los roles en backend- La mejor explicación en español",
      "category": "Back End",
      "image": "https://img.youtube.com/vi/ZTsi1e-VJIU/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=ZTsi1e-VJIU",
      "description": "El backend es todo lo que ocurre en el lado del servidor para que una aplicación web funcione. En el servidor se manejan los datos, las API, la seguridad y los sistemas operativos. ¿Conoces cuales son los roles? Te lo explicamos en este video."
    },
    {
      "id": "15",
      "title": "¿Qué es Java y cuál es su historia?",
      "category": "Back End",
      "image": "https://img.youtube.com/vi/E8weQyNVWug/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=E8weQyNVWug",
      "description": "Java es el tercer lenguaje más usado en el mundo del desarrollo de software según el índice TIOBE (solo detrás de Python y C) y uno de los más demandados por las grandes empresas de tecnología. En este video te explicaremos por qué Java sigue dominando la web y no ha caído en más de 25 años."
    },
    {
      "id": "16",
      "title": "¿Cuál es el mejor lenguaje de programación de Backend para ti?",
      "category": "Back End",
      "image": "https://img.youtube.com/vi/eymgiK3y2mU/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=eymgiK3y2mU",
      "description": "Si estas considerando dedicarte al desarrollo web Backend profesional, y has visto que hay muchos lenguajes de programación, y no sabes por cual decidirte, en este video te voy a dar una lista de lenguajes que puedes estudiar para obtener un trabajo bien remunerado o seguir avanzando en tu carrera como programador."
    },
    {
      "id": "17",
      "title": "La historia completa de la Inteligencia Artificial (por EDteam)",
      "category": "Inteligencia Artificial",
      "image": "https://img.youtube.com/vi/WCM0h9TX7cY/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=WCM0h9TX7cY",
      "description": "Muchas personas creen que la Inteligencia Artificial nació con ChatGPT. Pero no. Eso es mentira. Su historia se remonta a los años 50 y ha evolucionado hasta lo que conocemos hoy en día."
    },
    {
      "id": "18",
      "title": "Ruta de Aprendizaje para aprender Inteligencia artificial",
      "category": "Inteligencia Artificial",
      "image": "https://img.youtube.com/vi/1dJ-x6Zxrmc/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=1dJ-x6Zxrmc",
      "description": "Convertirse en un Ingeniero de Inteligencia Artificial (AI Engineer) o Ingeniero de Machine Learning (Machine Learning Engineer) no es una tarea fácil, sobre todo porque esta área abarca temas de programación, ciencia de datos y matemáticas, y las combina para crear aplicaciones prácticas."
    },
    {
      "id": "19",
      "title": "La 'IA' lo cambia TODO | Lo que deberías saber sobre la Inteligencia Artificial",
      "category": "Inteligencia Artificial",
      "image": "https://img.youtube.com/vi/bOQjgy1PhUg/maxresdefault.jpg",
      "video": "https://www.youtube.com/watch?v=bOQjgy1PhUg",
      "description": "En este vídeo profundizamos en el mundo de la inteligencia artificial: su evolución, cómo funciona, y su capacidad de cambiar dinámicas de poder entre las gigantes tecnológicas."
    }
  ]
}